// 투표 결과 배열
let votes = [
  '이재식', '이재식', '이규하', '이규하', '이규하',
  '이재식', '이재식', '이규하', '이규하', '이재식',
  '이규하', '이규하', '이규하', '이규하', '이재식',
  '이재식', '이규하', '이재식', '이재식', '이재식',
  '이재식', '이재식', '이규하', '이규하', '이규하',
  '이규하', '이규하', '이재식', '이규하', '이규하',
  '이규하', '이규하', '이재식', '이규하', '이규하',
  '이규하', '이재식', '이재식', '이재식', '이규하',
];

// 후보별 득표수 객체
let voteCounter = {};

// 여기에 코드를 작성하세요
for (let vote of votes){
  if (vote in voteCounter){
    voteCounter[vote]+=1;
  } else{
    voteCounter[vote]=1;
  }
}

// 테스트 코드
console.log(voteCounter);